import os

virts = """всём привет  
это мануал как бить вирты 
делал ферзь @TEPOP_FERZ
переходник  @ferzevoyperexodnik
начинаем 
ххххххххххххххххххххххххххххххххххххххххххххх
у вас есть номер и вам надо узнать вирт или нет, как? 
вам поможет см см центре и HRL  запрос обслуживается или нет 
есла да то не вирт если нет то вирт  и так мы разбираем последний вариант

1 мы знаем вирт и знаем где его брала жертва 

всё очень просто идём просить логи оттуда 

Здравствуйте, это ФСБ ведётся расследование и нам нужно у вас узнать с какого номера телефона был приобретён этот виртуальный номер *вирт номер
 
здравствуйте, я являюсь агентом безопасности в интернете, мне нужна информация о покупателе вот этого вирт номера 

2мы знаем вирт, но не знаем где его покупала жертва 

если мы не знаем где брался вирт, то чекаем 1 страницу гугла по покупкам виртов и пишем им На
 почту  и чекаем ботов по типу смс активации и т.д

Здравствуйте, это ФСБ ведётся расследование и нам нужно у вас узнать с какого номера телефона был приобретён этот виртуальный номер *вирт номер
 
здравствуйте, я являюсь агентом безопасности в интернете, мне нужна информация о покупателе вот этого вирт номера 

3 мы не нихуя не знаем, тогда читаем другие мои мануалы, которые можно у меня купить 

хххххххххххххххххххххххххххххххххххххххххххххх
и в заключение не всё дают логи, но абсолютное большинство даёт 
и всём удачи """

print(virts)