import os

manualdoxxx = """Обучение деанонимизации | Полный курс | Слил @ummyprogs
Привет, друг! Спасибо за приобретение моего курса.
В данном курсе представлены: Способы деанонимизаций, методы анонимности, терминология.
Обязательно к прочтению:
* Приобретая данный курс я обязуюсь научить Вас находить информацию, и я обязан Вам помочь освоиться в этой сфере и передать свои знания, в зависимости от цены моих мануалов. 
* Покупаю обучение у меня, Вы получаете исключительно оригинальный контент, которого нет в открытом доступе.

#Введение

Для того, чтобы конкретно понимать значения слова анонимизация и деанонимизация, предлагаю Вам ознакомиться с базовыми терминами:

·Деанон — или же деанонимизация, процесс, при котором раскрывают, например, анонимную личность.
    Раскрытие проявляется в публикации личных данных, чаще всего под этим понимается публикация реальных фотографий человека, в других случаях — это публикация полных сведений о человеке.

·Анонимизация - процесс удаления данных с целью сокрытия личности пользователя.

·Новорег — аккаунт зарегистрированный совсем недавно.

·Вирт — Ненастоящий номер, привязанный к аккаунту в соц-сетях, или же просто номер зарегистрированный на другого человека.

·Ава — графическое представление пользователя

·Юзернейм (юзерка) — имя пользователя

·Осинт - поиск по открытым источникам. Это сбор и анализ данных, находящихся в открытом доступе, для получения более подробной информации.

·Скамер (от англ. scam — мошенничество, обман) — это личность или группа лиц, которая совершает мошеннические сделки в соц-сетях, пользуясь доверительным отношением людей.

·Фейк - это ложная, недостоверная, выдаваемая за действительное информация.

#Методы анонимности

Как защититься от деанонимизации и стать анонимным?
Распишу вкратце основные пункты, что категорически нельзя делать:

Не используйте одинаковые никнеймы и псевдонимы 
Не сообщайте и не указывайте своих реальных данных
Не регистрируйтесь на свой реальный номер
Используйте настройки приватности ваших соц.сетей
Постарайтесь не использовать свои реальные фото 
А если используете, то лучше делайте их с фильтрами/ с определенного ракурса
Не выдавайте своих данных малознакомым людям. 
Не используйте свои реквизиты
Если Вы делаете контент, для доната и подобного, используйте специальные сервисы по типу:
Donationalerts/QiwiCard
Не присылайте фото объектов вашего города.
Старайтесь говорить недостоверную информацию.


#ПОИСК ИНФОРМАЦИИ ПРИ ПОМОЩИ ПОИСКОВИКОВ:

Первым делом необходимо проверить человека по интернет поисковикам. Тут вы найдете многие вещи о которых сразу даже не догадываетесь (например: объявления о продаже, регистрацию на сайтах по интересам, упоминания в прессе и т.д.) Для этого открываем всеми известный бразуер - Яндекс Браузер.
Первое и самое важное, это поиск через: 'intext:', ибо это самая важная часть в деанонах.
                                    -Как работает intext:?
                                    -Очень просто.
                                    Мы вписываем в поисковой запрос, например, intext:cyberbyllying , и теперь нам выдаст ссылки на все посты, где упоминалось данное слово. 
                                    Так-же есть подобие интексту, Называется site:
                                    Его можно использовать совместно с intext:
                                    Когда ты пишешь site: ,например, site:youtube.com, тебе выдаёт все запросы с сайта youtube.com
                                    А как это использовать с intext: ?
                                    intext:cyberbyllying site:vk.com                        
#Подробное пояснение: 

Производим поисковой запрос в Яндекс-Поиске: intext:cyberbyllying - выдаёт все сайты, где упоминался ник "cyberbyllying"
intext:cyberbyllying site:vk.com - выдаёт все посты с сайта ВК, где упоминался тег "cyberbyllying"
По нику "cyberbyllying" мы находим страницу ВК, далее можем ее прогнать по сервисам:
Имеем: https://vk.com/cyberbyllying
Получаем данные с сайта VK.COM⬇
ID: 701309190
Логин: cyberbyllying
Дата рождения: 6.6.1999
Дата регистрации: 27.01.2022
Далее проанализируем страницу вк, как найти город нашего анонимуса, для этого заходим в друзья пользователя, и смотрим наиболее популярный город.
И так снова повторяете поиск по различным параметрам, которые вы смогли найти на человека в предыдущих пунктах инструкции. Накапливаете и обобщаете всю найденную информацию.
Так же в поисковиках можно пробить никнейм, ID страниц соц. сетей, и узнать необходимую информацию.

#ПОИСК ИНФОРМАЦИИ ПО СТРАНИЦЕ ВК:

Если у Вас имеется страница ВК, то Вам следует выполнить следующий алгоритм для успешного нахождения анонимуса.

Алгоритм:
1. Найти id профиля
2. Узнать дату регистрации
3. Проанализировать страницу
    3.1 Узнать реальный город
    3.2 Посмотреть упомянания
    3.3 Посмотреть историю смены имени
    UPD: Что делаеть если профиль человека закрытый?
        - Пропускаем 3 пункт и сразу переходим к 4.
4. Найти архивы страницы
5. Сделать вывод и воспользоваться полученной информацией.

Алгоритм(Подробное описание)

1. И так, первым делом нужно узнать цифровой id профиля. Для этого воспользуемся сайтом - https://regvk.com/id/ --> Вводим ссылку на страницу и получаем цифровой ID: 701309190

2. Далее нужно узнать дату регистрации аккаунта. Для этого воспользуемся сайтом - https://regvk.com --> Вводим ссылку на страницу и получаем дату регистрации аккаунта: 27.01.2022г

3. Следующим этапом является анализирование страницы. Я разделю этот пункт на 3 подпункта...
    >3.1 - Для того, чтобы в 90% случаях найти реальный город жертвы, нам потребуется перейти во вкладку Друзья ==> Параметры --> Выбор города. Первый высветившийся город будет наиболее популярен среди его друзей.
    >3.2 - Для того, чтобы посмотреть упомянания профиля VK, нам потребуется видоизменить ссылку - https://vk.com/feed?obj=XXXXXX&q=&section=mentions . За место "XXXXXX" Поставьте цифровой ID профиля. Далее вставляем видоизмененную ссылку в браузер. Получаем все упомянания профиля.
    >3.3 - Для того, чтобы посмотреть смену истории имени по определенной странице, переходим в телеграмм бота - @FindNameVk_bot. Вставляем ссылку на страницу --> Получаем историю смены имен: Иннокентий Провайдеров, Иннокентий Разумный.
4. Следующим шагом, будет просмотр архивов страницы VK. Сделать это можно 2-мя способами:
    4.1 - Переходим в телеграмм бота: @VKHistoryRobot. Вставляем ссылку на страницу --> получаем архивы, фото по годам.
    4.2 - Уже известен Вам, делается это через браузер. Продублирую вышенаписанные сообщения: 
    Производим поисковой запрос в Яндекс-Поиске: intext:cyberbyllying - выдаёт все сайты, где упоминался никнейм "cyberbyllying"
    intext:id701309190 site:vk.com - выдаёт все посты с сайта ВК, где упоминался id "id701309190"
    По нику "cyberbyllying" мы изначально смогли бы страницу ВК.

ПОИСК ИНФОРМАЦИИ ПО НОМЕРУ ТЕЛЕФОНА:
    Это будет самый масштабный раздел. И так начинаем!
    Первым делом нам нужно проверить этот номер на валидность. Как это сделать? Заходим на сайт https://smsc.ru/testhlr/ и выполняем HLR запрос на известный или найденный номер.
    Номер доступен. Можно идти дальше. Если же пишет, что номер телефона не находится в сети, это может объясниться 3 причинами:
    -Номер телефона стар, заблокирован.
    -Включен режим полета
    -Номер телефона виртуален.
    Даже если номер не в сети, можно продолжать его проверку и поиск информации, проверим номер на утечки.
     Что означает проверить номер телефона на утечки?
      Это означает проверить его в базах данных. Перейдем к делу, для этого воспользуемся следующими сервисами:
        @RussianProbiv_Bot - Осинт-Бот, второй по популярности бот по пробиву, включает в себя поиск по номеру, соц-сетям, почте, и тп.
        @UniversalSearchRobot - Бот находит привязанный аккаунт Вк по номеру телефона.
        @RussianProbivBot - Самый популярный бот по пробиву в телеграмм. ГлазБога - Это бот включающий в себя поиск, по номеру, фио, адресу, паспорту, страницам в соц-сетях, номеру машины.
        @UsersSearchBot - Поиск по Фио, Номеру и VK.
        @dfjasfdjasnbot - Продвинутый поиск по обширным базам. Поиск по ФИО, Номеру.
        @detectiva_bot - Поиск данных по номеру телефона, и страницам в соц-сетях(VK, OK, FACEBOOK, Instagram, Telegram)
        @getcontact_real_bot - Поиск записей в телефонной книге по номеру телефона.
        @bmi_np_bot - Узнаем оператора и регион.
        @PasswordSearchBot - Пробив по почте, находит слитые пароли в базе данных.
        vk.com/app3256362_209176882 - просмотр чс и скрытых друзей
Всю информацию еще раз анализируем и сохраняем в один текстовый-документ.
Следущим пунктом будет проверка номера телефона на наличие соц.сетей:

      Восстановление доступа:
1. ICQ (https://icq.com/password/ru)
2. OK.ru (https://ok.ru/password/recovery)
3. Twitter (https://twitter.com/account/begin_password_reset)
4. VK.com (https://vk.com/restore)
5. Facebook (https://www.facebook.com/login/identify?ctx=recover)
6. Microsoft (https://account.live.com/acsr)
7. Instagram (https://www.instagram.com/accounts/password/reset/)

ПУБЛИКАЦИЯ ДЕАНОНИМИЗАЦИЙ:
Публикуя свои работы(деанонимизации) вы принимаете на себя уголовную ответственность(если инфа была добыта незаконным путем и уж тем более без причины). 
Какие бывают причины для того, что бы начать деанонить человека? 
1. Мошенничесво
2. Угрозы, Троллинг
3. Кибер-Преступления
Публикация деанонимизаций может происходить на пасты:
https://pastebin.pl/
https://ghostbin.co/
https://doxbin.com/
Спасибо за прочтение данного курса.

Слил @ummyprogs
"""

print(manualdoxxx)