#UPDATE BY @peregodasoru
#UPDATE BY @peregodasoru
#UPDATE BY @peregodasoru
banner = '''
███╗   ██╗ █████╗ ████████╗██╗  ██╗ █████╗  ██████╗██╗  ██╗
████╗  ██║██╔══██╗╚══██╔══╝██║  ██║██╔══██╗██╔════╝██║ ██╔╝
██╔██╗ ██║███████║   ██║   ███████║███████║██║     █████╔╝ 
██║╚██╗██║██╔══██║   ██║   ██╔══██║██╔══██║██║     ██╔═██╗ 
██║ ╚████║██║  ██║   ██║   ██║  ██║██║  ██║╚██████╗██║  ██╗
╚═╝  ╚═══╝╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝                                                                          
═══════════════════════════════════════════════════════════
ПРОГРАММА НЕ ПОДЛЕЖИТ ПРОДАЖЕ

Update by: @asoruperehod
═══════════════════════════════════════════════════════════

Main menu ≡

╔══════════════════════════════════════════════════════════════╗
║ 1) Поиск по Номеру           | 5) Получить прокси            ‖  
║ 2) Пробив по IP адресу       | 6) Поиск по токену бота       ‖  
║ 3) Пробив по email           | 7) Пробив по ВК               ‖ 
║ 4) DDOS                      | 8) Фишинг ТГ                  ‖          
║                         99) Exit                             ‖
╚══════════════════════════════════════════════════════════════╝
 '''
#UPDATE BY @peregodasoru
#UPDATE BY @peregodasoru
#UPDATE BY @peregodasoru